/// #define SFML_STATIC ///<--- в настройках ИДЕ.
///----------------------------------------------------------------------------|
/// ...
///----------------------------------------------------------------------------:
#include "scenes\programm.h"

///----------------------------------------------------------------------------|
/// Start.
///----------------------------------------------------------------------------:
int main()
{
    setlocale(0,"");

    std::wcout << L"Старт ...\n\n";

    try
    {   Programm run;
    }
    catch(const char* s) {std::cout << "FATALERROR::" << s << std::endl; }

    std::wcout << L"Прога завершила работу.\n\n";
}
